In [29]:
import numpy as np
import pandas as pd
np.random.seed(0)
df = pd.DataFrame({'state': ['CA', 'WA', 'CO', 'AZ'] * 3,
                   'office_id': list(range(1, 7)) * 2,
                   'sales': [np.random.randint(100000, 999999)
                             for _ in range(12)]})

In [30]:
df

   state  office_id   sales
0     CA          1  405711
1     WA          2  535829
2     CO          3  217952
3     AZ          4  252315
4     CA          5  982371
5     WA          6  459783
6     CO          1  404137
7     AZ          2  222579
8     CA          3  710581
9     WA          4  548242
10    CO          5  474564
11    AZ          6  835831

In [34]:
state_office = df.groupby(['state', 'office_id']).agg({'sales':'sum'})

In [48]:
state_office2 = df.groupby(['state']).agg({'sales':'sum'})

In [53]:
state_office.axes

[MultiIndex(levels=[['AZ', 'CA', 'CO', 'WA'], [1, 2, 3, 4, 5, 6]],
            codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2, 3, 3, 3], [1, 3, 5, 0, 2, 4, 0, 2, 4, 1, 3, 5]],
            names=['state', 'office_id']), Index(['sales'], dtype='object')]

If we had a fourth column named 'cost' we would specifically call ['sales'].apply(lambda function)

In [46]:
state_pctg = state_office.groupby(level=0).apply(lambda x: 100* x / float(x.sum()))

In [47]:
state_pctg

                     sales
state office_id
AZ    2          16.981365
      4          19.250033
      6          63.768601
CA    1          19.331879
      3          33.858747
      5          46.809373
CO    1          36.851857
      3          19.874290
      5          43.273852
WA    2          34.707233
      4          35.511259
      6          29.781508

In [11]:
total = df['sales'].sum()

In [12]:
ca_sales = df.loc[0,'sales']

In [13]:
ca_sales / total

0.06706083328718929

In [21]:
new_df = df.groupby(['state']).sum()

In [22]:
new_df

       office_id    sales
state
AZ            12  1310725
CA             9  2098663
CO             9  1096653
WA            12  1543854

In [28]:
list(df.groupby('state')['sales'])

[('AZ', 3     252315
  7     222579
  11    835831
  Name: sales, dtype: int64), ('CA', 0    405711
  4    982371
  8    710581
  Name: sales, dtype: int64), ('CO', 2     217952
  6     404137
  10    474564
  Name: sales, dtype: int64), ('WA', 1    535829
  5    459783
  9    548242
  Name: sales, dtype: int64)]

In [24]:
new_df['sales'] = df['sales'] / total

In [54]:
new_df

       office_id  sales
state
AZ            12    NaN
CA             9    NaN
CO             9    NaN
WA            12    NaN

In [ ]:
pd.merge()